src/object-diagram/logic/test-suites/miscellaneous/tests/enum/writer/expected.gv
digraph ObjectDiagram {
  node [shape=plaintext]
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;[StackFrame]&gt;&gt;</i></td></th>
    <tr><td align="left">borderWidth</td><td align="left" port="borderWidth">5 (int)</td></tr>
    <tr><td align="left">args</td><td align="left" port="args"></td></tr>
    <tr><td align="left">topLeft</td><td align="left" port="topLeft"></td></tr>
    <tr><td align="left">topLeftCopy</td><td align="left" port="topLeftCopy"></td></tr>
    <tr><td align="left">bottomRight</td><td align="left" port="bottomRight"></td></tr>
    <tr><td align="left">background</td><td align="left" port="background"></td></tr>
  </table>>]
  _bdb37fd1fa1b13d2c62e42aa9a27afaa093a1889 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;String[]&gt;&gt;</i></td></th>
    <tr><td colspan="2">[]</td></tr>
  </table>>]
  _46c25277abcd692a5e18dbd97d65eb7d62791a96 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;Point&gt;&gt;</i></td></th>
    <tr><td align="left">x</td><td align="left" port="x">1 (int)</td></tr>
    <tr><td align="left">y</td><td align="left" port="y">1 (int)</td></tr>
  </table>>]
  _a6ed3c1901ccfa2adffe839bb7b830200a6393ef [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;Point&gt;&gt;</i></td></th>
    <tr><td align="left">x</td><td align="left" port="x">5 (int)</td></tr>
    <tr><td align="left">y</td><td align="left" port="y">7 (int)</td></tr>
  </table>>]
  _997cc01d7a247aeedb702fa90f2b9ab4ef820a7b [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;Color&gt;&gt;</i></td></th>
    <tr><td align="left">ordinal</td><td align="left" port="ordinal">2 (int)</td></tr>
    <tr><td align="left">hexValue</td><td align="left" port="hexValue"></td></tr>
    <tr><td align="left">name</td><td align="left" port="name"></td></tr>
    <tr><td align="left">textValue</td><td align="left" port="textValue"></td></tr>
  </table>>]
  _9c04b7d66febb3f9b9860ba0795ec96cd00ebd7b [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;String&gt;&gt;</i></td></th>
    <tr><td colspan="2">"#0000FF"</td></tr>
  </table>>]
  _998c19af6e8387e89fb44a945734ec829e663b43 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;String&gt;&gt;</i></td></th>
    <tr><td colspan="2">"BLUE"</td></tr>
  </table>>]
  _c8f291339090d790de0913e8078a801c796e0248 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;String&gt;&gt;</i></td></th>
    <tr><td colspan="2">"blue"</td></tr>
  </table>>]
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:args -> _bdb37fd1fa1b13d2c62e42aa9a27afaa093a1889
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:topLeft -> _46c25277abcd692a5e18dbd97d65eb7d62791a96
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:topLeftCopy -> _46c25277abcd692a5e18dbd97d65eb7d62791a96
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:bottomRight -> _a6ed3c1901ccfa2adffe839bb7b830200a6393ef
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:background -> _997cc01d7a247aeedb702fa90f2b9ab4ef820a7b
  _997cc01d7a247aeedb702fa90f2b9ab4ef820a7b:hexValue -> _9c04b7d66febb3f9b9860ba0795ec96cd00ebd7b
  _997cc01d7a247aeedb702fa90f2b9ab4ef820a7b:name -> _998c19af6e8387e89fb44a945734ec829e663b43
  _997cc01d7a247aeedb702fa90f2b9ab4ef820a7b:textValue -> _c8f291339090d790de0913e8078a801c796e0248
}
