src/object-diagram/logic/test-suites/miscellaneous/tests/enum/writer/expected.puml
@startuml
map "<<[StackFrame]>>" as _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352 {
  borderWidth => 5 (int)
  args =>
  topLeft =>
  topLeftCopy =>
  bottomRight =>
  background =>
}
object "<<String[]>>" as _bdb37fd1fa1b13d2c62e42aa9a27afaa093a1889 {
  []
}
map "<<Point>>" as _46c25277abcd692a5e18dbd97d65eb7d62791a96 {
  x => 1 (int)
  y => 1 (int)
}
map "<<Point>>" as _a6ed3c1901ccfa2adffe839bb7b830200a6393ef {
  x => 5 (int)
  y => 7 (int)
}
map "<<Color>>" as _997cc01d7a247aeedb702fa90f2b9ab4ef820a7b {
  ordinal => 2 (int)
  hexValue =>
  name =>
  textValue =>
}
object "<<String>>" as _9c04b7d66febb3f9b9860ba0795ec96cd00ebd7b {
  "#0000FF"
}
object "<<String>>" as _998c19af6e8387e89fb44a945734ec829e663b43 {
  "BLUE"
}
object "<<String>>" as _c8f291339090d790de0913e8078a801c796e0248 {
  "blue"
}
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::args => _bdb37fd1fa1b13d2c62e42aa9a27afaa093a1889
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::topLeft => _46c25277abcd692a5e18dbd97d65eb7d62791a96
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::topLeftCopy => _46c25277abcd692a5e18dbd97d65eb7d62791a96
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::bottomRight => _a6ed3c1901ccfa2adffe839bb7b830200a6393ef
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::background => _997cc01d7a247aeedb702fa90f2b9ab4ef820a7b
_997cc01d7a247aeedb702fa90f2b9ab4ef820a7b::hexValue => _9c04b7d66febb3f9b9860ba0795ec96cd00ebd7b
_997cc01d7a247aeedb702fa90f2b9ab4ef820a7b::name => _998c19af6e8387e89fb44a945734ec829e663b43
_997cc01d7a247aeedb702fa90f2b9ab4ef820a7b::textValue => _c8f291339090d790de0913e8078a801c796e0248
@enduml
